grevaillot/svd_tools/headers/STM32F3x4/hrtim_time.h
/** @defgroup hrtim_time_timedier5 TIMEDIER5 TIMxDIER5
@{*/

/** HRTIM_TIME_TIMEDIER5_DLYPRTDE DLYPRTDE **/
#define HRTIM_TIME_TIMEDIER5_DLYPRTDE		(1 << 30)
/** HRTIM_TIME_TIMEDIER5_RSTDE RSTDE **/
#define HRTIM_TIME_TIMEDIER5_RSTDE		(1 << 29)
/** HRTIM_TIME_TIMEDIER5_RSTx2DE RSTx2DE **/
#define HRTIM_TIME_TIMEDIER5_RSTx2DE		(1 << 28)
/** HRTIM_TIME_TIMEDIER5_SETx2DE SETx2DE **/
#define HRTIM_TIME_TIMEDIER5_SETx2DE		(1 << 27)
/** HRTIM_TIME_TIMEDIER5_RSTx1DE RSTx1DE **/
#define HRTIM_TIME_TIMEDIER5_RSTx1DE		(1 << 26)
/** HRTIM_TIME_TIMEDIER5_SET1xDE SET1xDE **/
#define HRTIM_TIME_TIMEDIER5_SET1xDE		(1 << 25)
/** HRTIM_TIME_TIMEDIER5_CPT2DE CPT2DE **/
#define HRTIM_TIME_TIMEDIER5_CPT2DE		(1 << 24)
/** HRTIM_TIME_TIMEDIER5_CPT1DE CPT1DE **/
#define HRTIM_TIME_TIMEDIER5_CPT1DE		(1 << 23)
/** HRTIM_TIME_TIMEDIER5_UPDDE UPDDE **/
#define HRTIM_TIME_TIMEDIER5_UPDDE		(1 << 22)
/** HRTIM_TIME_TIMEDIER5_REPDE REPDE **/
#define HRTIM_TIME_TIMEDIER5_REPDE		(1 << 20)
/** HRTIM_TIME_TIMEDIER5_CMP4DE CMP4DE **/
#define HRTIM_TIME_TIMEDIER5_CMP4DE		(1 << 19)
/** HRTIM_TIME_TIMEDIER5_CMP3DE CMP3DE **/
#define HRTIM_TIME_TIMEDIER5_CMP3DE		(1 << 18)
/** HRTIM_TIME_TIMEDIER5_CMP2DE CMP2DE **/
#define HRTIM_TIME_TIMEDIER5_CMP2DE		(1 << 17)
/** HRTIM_TIME_TIMEDIER5_CMP1DE CMP1DE **/
#define HRTIM_TIME_TIMEDIER5_CMP1DE		(1 << 16)
/** HRTIM_TIME_TIMEDIER5_DLYPRTIE DLYPRTIE **/
#define HRTIM_TIME_TIMEDIER5_DLYPRTIE		(1 << 14)
/** HRTIM_TIME_TIMEDIER5_RSTIE RSTIE **/
#define HRTIM_TIME_TIMEDIER5_RSTIE		(1 << 13)
/** HRTIM_TIME_TIMEDIER5_RSTx2IE RSTx2IE **/
#define HRTIM_TIME_TIMEDIER5_RSTx2IE		(1 << 12)
/** HRTIM_TIME_TIMEDIER5_SETx2IE SETx2IE **/
#define HRTIM_TIME_TIMEDIER5_SETx2IE		(1 << 11)
/** HRTIM_TIME_TIMEDIER5_RSTx1IE RSTx1IE **/
#define HRTIM_TIME_TIMEDIER5_RSTx1IE		(1 << 10)
/** HRTIM_TIME_TIMEDIER5_SET1xIE SET1xIE **/
#define HRTIM_TIME_TIMEDIER5_SET1xIE		(1 << 9)
/** HRTIM_TIME_TIMEDIER5_CPT2IE CPT2IE **/
#define HRTIM_TIME_TIMEDIER5_CPT2IE		(1 << 8)
/** HRTIM_TIME_TIMEDIER5_CPT1IE CPT1IE **/
#define HRTIM_TIME_TIMEDIER5_CPT1IE		(1 << 7)
/** HRTIM_TIME_TIMEDIER5_UPDIE UPDIE **/
#define HRTIM_TIME_TIMEDIER5_UPDIE		(1 << 6)
/** HRTIM_TIME_TIMEDIER5_REPIE REPIE **/
#define HRTIM_TIME_TIMEDIER5_REPIE		(1 << 4)
/** HRTIM_TIME_TIMEDIER5_CMP4IE CMP4IE **/
#define HRTIM_TIME_TIMEDIER5_CMP4IE		(1 << 3)
/** HRTIM_TIME_TIMEDIER5_CMP3IE CMP3IE **/
#define HRTIM_TIME_TIMEDIER5_CMP3IE		(1 << 2)
/** HRTIM_TIME_TIMEDIER5_CMP2IE CMP2IE **/
#define HRTIM_TIME_TIMEDIER5_CMP2IE		(1 << 1)
/** HRTIM_TIME_TIMEDIER5_CMP1IE CMP1IE **/
#define HRTIM_TIME_TIMEDIER5_CMP1IE		(1 << 0)

/**@}*/

/** @defgroup hrtim_time_cnter CNTER Timerx Counter Register
@{*/


#define HRTIM_TIME_CNTER_CNTx_SHIFT		0
#define HRTIM_TIME_CNTER_CNTx_MASK		0xffff
/** @defgroup hrtim_time_cnter_cntx CNTx Timerx Counter value
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_time_perer PERER Timerx Period Register
@{*/


#define HRTIM_TIME_PERER_PERx_SHIFT		0
#define HRTIM_TIME_PERER_PERx_MASK		0xffff
/** @defgroup hrtim_time_perer_perx PERx Timerx Period value
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_time_reper REPER Timerx Repetition Register
@{*/


#define HRTIM_TIME_REPER_REPx_SHIFT		0
#define HRTIM_TIME_REPER_REPx_MASK		0xff
/** @defgroup hrtim_time_reper_repx REPx Timerx Repetition counter value
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_time_cmp1er CMP1ER Timerx Compare 1 Register
@{*/


#define HRTIM_TIME_CMP1ER_CMP1x_SHIFT		0
#define HRTIM_TIME_CMP1ER_CMP1x_MASK		0xffff
/** @defgroup hrtim_time_cmp1er_cmp1x CMP1x Timerx Compare 1 value
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_time_cmp1cer CMP1CER Timerx Compare 1 Compound Register
@{*/


#define HRTIM_TIME_CMP1CER_REPx_SHIFT		16
#define HRTIM_TIME_CMP1CER_REPx_MASK		0xff
/** @defgroup hrtim_time_cmp1cer_repx REPx Timerx Repetition value (aliased from HRTIM_REPx register)
@{*/
/**@}*/


#define HRTIM_TIME_CMP1CER_CMP1x_SHIFT		0
#define HRTIM_TIME_CMP1CER_CMP1x_MASK		0xffff
/** @defgroup hrtim_time_cmp1cer_cmp1x CMP1x Timerx Compare 1 value
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_time_cmp2er CMP2ER Timerx Compare 2 Register
@{*/


#define HRTIM_TIME_CMP2ER_CMP2x_SHIFT		0
#define HRTIM_TIME_CMP2ER_CMP2x_MASK		0xffff
/** @defgroup hrtim_time_cmp2er_cmp2x CMP2x Timerx Compare 2 value
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_time_cmp3er CMP3ER Timerx Compare 3 Register
@{*/


#define HRTIM_TIME_CMP3ER_CMP3x_SHIFT		0
#define HRTIM_TIME_CMP3ER_CMP3x_MASK		0xffff
/** @defgroup hrtim_time_cmp3er_cmp3x CMP3x Timerx Compare 3 value
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_time_cmp4er CMP4ER Timerx Compare 4 Register
@{*/


#define HRTIM_TIME_CMP4ER_CMP4x_SHIFT		0
#define HRTIM_TIME_CMP4ER_CMP4x_MASK		0xffff
/** @defgroup hrtim_time_cmp4er_cmp4x CMP4x Timerx Compare 4 value
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_time_cpt1er CPT1ER Timerx Capture 1 Register
@{*/


#define HRTIM_TIME_CPT1ER_CPT1x_SHIFT		0
#define HRTIM_TIME_CPT1ER_CPT1x_MASK		0xffff
/** @defgroup hrtim_time_cpt1er_cpt1x CPT1x Timerx Capture 1 value
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_time_cpt2er CPT2ER Timerx Capture 2 Register
@{*/


#define HRTIM_TIME_CPT2ER_CPT2x_SHIFT		0
#define HRTIM_TIME_CPT2ER_CPT2x_MASK		0xffff
/** @defgroup hrtim_time_cpt2er_cpt2x CPT2x Timerx Capture 2 value
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_time_dter DTER Timerx Deadtime Register
@{*/

/** HRTIM_TIME_DTER_DTFLKx Deadtime Falling Lock **/
#define HRTIM_TIME_DTER_DTFLKx		(1 << 31)
/** HRTIM_TIME_DTER_DTFSLKx Deadtime Falling Sign Lock **/
#define HRTIM_TIME_DTER_DTFSLKx		(1 << 30)
/** HRTIM_TIME_DTER_SDTFx Sign Deadtime Falling value **/
#define HRTIM_TIME_DTER_SDTFx		(1 << 25)

#define HRTIM_TIME_DTER_DTFx_SHIFT		16
#define HRTIM_TIME_DTER_DTFx_MASK		0x1ff
/** @defgroup hrtim_time_dter_dtfx DTFx Deadtime Falling value
@{*/
/**@}*/

/** HRTIM_TIME_DTER_DTRLKx Deadtime Rising Lock **/
#define HRTIM_TIME_DTER_DTRLKx		(1 << 15)
/** HRTIM_TIME_DTER_DTRSLKx Deadtime Rising Sign Lock **/
#define HRTIM_TIME_DTER_DTRSLKx		(1 << 14)

#define HRTIM_TIME_DTER_DTPRSC_SHIFT		10
#define HRTIM_TIME_DTER_DTPRSC_MASK		0x07
/** @defgroup hrtim_time_dter_dtprsc DTPRSC Deadtime Prescaler
@{*/
/**@}*/

/** HRTIM_TIME_DTER_SDTRx Sign Deadtime Rising value **/
#define HRTIM_TIME_DTER_SDTRx		(1 << 9)

#define HRTIM_TIME_DTER_DTRx_SHIFT		0
#define HRTIM_TIME_DTER_DTRx_MASK		0x1ff
/** @defgroup hrtim_time_dter_dtrx DTRx Deadtime Rising value
@{*/
/**@}*/


/**@}*/

