grevaillot/svd_tools/headers/STM32F3x4/hrtim_time.h
#define HRTIM_TIME_OUTER_FAULT2_SHIFT		20
#define HRTIM_TIME_OUTER_FAULT2_MASK		0x03
/** @defgroup hrtim_time_outer_fault2 FAULT2 Output 2 Fault state
@{*/
/**@}*/

/** HRTIM_TIME_OUTER_IDLES2 Output 2 Idle State **/
#define HRTIM_TIME_OUTER_IDLES2		(1 << 19)
/** HRTIM_TIME_OUTER_IDLEM2 Output 2 Idle mode **/
#define HRTIM_TIME_OUTER_IDLEM2		(1 << 18)
/** HRTIM_TIME_OUTER_POL2 Output 2 polarity **/
#define HRTIM_TIME_OUTER_POL2		(1 << 17)

#define HRTIM_TIME_OUTER_DLYPRT_SHIFT		10
#define HRTIM_TIME_OUTER_DLYPRT_MASK		0x07
/** @defgroup hrtim_time_outer_dlyprt DLYPRT Delayed Protection
@{*/
/**@}*/

/** HRTIM_TIME_OUTER_DLYPRTEN Delayed Protection Enable **/
#define HRTIM_TIME_OUTER_DLYPRTEN		(1 << 9)
/** HRTIM_TIME_OUTER_DTEN Deadtime enable **/
#define HRTIM_TIME_OUTER_DTEN		(1 << 8)
/** HRTIM_TIME_OUTER_DIDL1 Output 1 Deadtime upon burst mode Idle entry **/
#define HRTIM_TIME_OUTER_DIDL1		(1 << 7)
/** HRTIM_TIME_OUTER_CHP1 Output 1 Chopper enable **/
#define HRTIM_TIME_OUTER_CHP1		(1 << 6)

#define HRTIM_TIME_OUTER_FAULT1_SHIFT		4
#define HRTIM_TIME_OUTER_FAULT1_MASK		0x03
/** @defgroup hrtim_time_outer_fault1 FAULT1 Output 1 Fault state
@{*/
/**@}*/

/** HRTIM_TIME_OUTER_IDLES1 Output 1 Idle State **/
#define HRTIM_TIME_OUTER_IDLES1		(1 << 3)
/** HRTIM_TIME_OUTER_IDLEM1 Output 1 Idle mode **/
#define HRTIM_TIME_OUTER_IDLEM1		(1 << 2)
/** HRTIM_TIME_OUTER_POL1 Output 1 polarity **/
#define HRTIM_TIME_OUTER_POL1		(1 << 1)

/**@}*/

/** @defgroup hrtim_time_flter FLTER Timerx Fault Register
@{*/

/** HRTIM_TIME_FLTER_FLTLCK Fault sources Lock **/
#define HRTIM_TIME_FLTER_FLTLCK		(1 << 31)
/** HRTIM_TIME_FLTER_FLT5EN Fault 5 enable **/
#define HRTIM_TIME_FLTER_FLT5EN		(1 << 4)
/** HRTIM_TIME_FLTER_FLT4EN Fault 4 enable **/
#define HRTIM_TIME_FLTER_FLT4EN		(1 << 3)
/** HRTIM_TIME_FLTER_FLT3EN Fault 3 enable **/
#define HRTIM_TIME_FLTER_FLT3EN		(1 << 2)
/** HRTIM_TIME_FLTER_FLT2EN Fault 2 enable **/
#define HRTIM_TIME_FLTER_FLT2EN		(1 << 1)
/** HRTIM_TIME_FLTER_FLT1EN Fault 1 enable **/
#define HRTIM_TIME_FLTER_FLT1EN		(1 << 0)

/**@}*/
